# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]  # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]  # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]  # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                         # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]   # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 6-P4/16

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 7 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 8
  - [-1, 1, Conv, [256, 1, 1]]  # 9, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [5, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 11 input_proj.1
  - [[-2, -1], 1, MCFM, [128]] # 12
  - [-1, 3, RepC3, [128, 0.5]]  # 13, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 14, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [4, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 16 input_proj.0
  - [[-2, -1], 1, MCFM, [128]]  # 17 cat backbone P3
  - [-1, 3, RepC3, [128, 0.5]]    # X3 (18), fpn_blocks.1

  - [-1, 1, Conv, [128, 3, 2]]   # 19, downsample_convs.0
  - [[-1, 11], 1, MCFM, [128]]  # 20 cat Y4
  - [-1, 3, RepC3, [128, 0.5]]    # F4 (21), pan_blocks.0

  - [-1, 1, Conv, [128, 3, 2]]   # 22, downsample_convs.1
  - [[-1, 7], 1, MCFM, [128]]  # 23 cat Y5
  - [-1, 3, RepC3, [128, 0.5]]    # F5 (24), pan_blocks.1

  - [[20,24], 1, RTDETRDecoder, [nc, 128, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
